a = []
i = 1

while i <= 3:
    a.append((i, {"название": input("Название товара: "),
                 "цена": input("Цена товара: "),
                 "количество": input("Количество товара: "),
                 "eд": "шт."})),
    i +=1

final_dict = {"название": [x[1]["название"] for x in a],
              "цена": [x[1]["цена"] for x in a],
              "количество": [x[1]["количество"] for x in a],
              "ед": ["шт."]}

for m, n in final_dict.items():
    print(m, n)